benchmarks/lora/definitive_results/performance_analysis/loading_overhead/throughput/with_pre_loading/llama-2-7b/p25_dataset/_1_16__8_run_1/log_12999578.out
WARNING 12-14 17:43:13 _custom_ops.py:14] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', base_url=None, host='localhost', port=8645, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/dummy_dataset_p25.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=8, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, request_rate=inf, request_rate_by_lora=None, seed=0, trust_remote_code=False, disable_tqdm=True, save_result=True, metadata=None, result_dir='benchmarks/lora/definitive_results/theory/lora_overhead/throughput/pre_loading/llama-2-7b/p25_dataset/_1_16__8_run_1', launch_server=True, server_args='--port=8645 --disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b --enable-lora --lora-modules=sql-lora=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b/lora/yard1_sql-lora-test_dummy_rank_16/ --max-num-seqs=4096 --max-loras=1 --max-lora-rank=16', disable_log_stats=False, disable_loras_users=False, user_lora_request_relation=None, infinite_behaviour=False, restrict_loras=None, lora_pre_loading=True)
Server started
Requests users. Values: ['0']. Counts: [8]
Requests loras. Values: ['sql-lora']. Counts: [8]
Error while running usage checker: HTTPConnectionPool(host='localhost', port=8645): Max retries exceeded with url: /metrics/ (Caused by NewConnectionError('<urllib3.connection.HTTPConnection object at 0x7f7231ad42b0>: Failed to establish a new connection: [Errno 111] Connection refused'))
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     8         
Benchmark duration (s):                  0.43      
Total input tokens:                      184       
Total generated tokens:                  216       
Request throughput (req/s):              18.51     
Input token throughput (tok/s):          425.67    
Output token throughput (tok/s):         499.69    
---------------Time to First Token----------------
Mean TTFT (ms):                          51.61     
Median TTFT (ms):                        57.73     
P99 TTFT (ms):                           58.21     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          14.60     
Median TPOT (ms):                        14.36     
P99 TPOT (ms):                           15.35     
---------------Inter-token Latency----------------
Mean ITL (ms):                           14.60     
Median ITL (ms):                         14.33     
P99 ITL (ms):                            15.29     
==================================================
Concurrent checker terminated
Server terminated